

// #region controller

app.controller("MottoController", function ($scope) {
    $scope.Motto = {
        Header: {
            Adage: "我可以走得很慢，但是我绝不后退。",
            Author: "亚伯拉罕.林肯",
            Desc: ""
        },
        List: [
            {
                No: 01,
                Adage: "人生没有彩排，每一次都是现场直播。",
                Author: "",
                Desc:[
                     "钱鹤滩的《明日歌》中，\"明日复明日， 明日何其多？\",我们大多数人过着日复一日，重复而单调的生活。但我们一旦想起后悔的事情就会说：\"要是当初怎么怎么样！就不会是现在这个样子！\"。是吧！为了不让以后的我们后悔的再次说出着这样的话，请认认真真的做好现在的每一件事吧！",
                     ""
                ]
            },
            {
                No: 02,
                Adage: "学如逆水行舟，不进则退；心似平原驰马，易放难收。",
                Author: "清•梁启超",  // 《莅山西票商欢迎会学说词》
                Desc: [
                    "多少人真真切切的经历着这句话！我们总喜欢放任自由的生活，如果你不去专心致志的去学，就会在生活中不断的淡忘直至遗忘曾经看的一眼。我们内心的自由，就像奔跑在草原上的快马，一旦我们习惯了这种自由，就很难回到当初的地方。或许，这句话对于每一个人而言太过苛刻，不过我们要把必须做的事情，心无旁骛的做好它。",
                    ""
                ]
            },
            {
                No: 03,
                Adage: "天降大任于斯人也，必先苦其心志，劳其筋骨，饿其体肤，空乏其身，行指乱其所为，所以动心忍性，曾益其所不能。",
                Author: "孟子",
                Desc: [
                    "这句圣人训，想必每个人都背的很熟。但是这样空泛的高论除了真切体味过的人，一般人并无感触。贾旭明在说相声时说，与时俱进的解释就是：\"天将降大任于斯人也，必先卸其QQ，封其微博，删其微信，去其贴吧，收其电脑，夺其手机，摔其ipad，断其wifi，剪其网线，使其百无聊赖，然后静坐、喝茶、思过、锻炼、读书、弹琴、练字、明智、开悟、精进，而后必成大器也。\"",
                    ""
                ]
            },
            {
                No: 04,
                Adage: "一直在被模仿，从未被超越。",
                Author: "可口可乐", // MJ拍的可口可乐广告
                Desc: [
                    "这句话是可口可乐的一句广告词！广告是MJ拍的，里面的口号就是一直被模仿，从未被超越。我们现在大多都是追逐别人的脚步，当他们停下时，我们也会止步不前。不是我们和别人看到的、接触的、想象的不同；而是我们偷懒、逃避、沮丧，不愿在别人未到达的区域，踏出那最艰难的第一步。",
                    ""
                ]
            },
            //{
            //    No: 05,
            //    Adage: "",
            //    Author: "",
            //    Desc: [
            //        "",
            //        ""
            //    ]
            //},
            //{
            //    No: 06,
            //    Adage: "",
            //    Author: "",
            //    Desc: [
            //        "",
            //        ""
            //    ]
            //},
            //{
            //    No: 07,
            //    Adage: "",
            //    Author: "",
            //    Desc: [
            //        "",
            //        ""
            //    ]
            //},
            //{
            //    No: 8,
            //    Adage: "",
            //    Author: "",
            //    Desc: [
            //        "",
            //        ""
            //    ]
            //},
            //{
            //    No: 09,
            //    Adage: "",
            //    Author: "",
            //    Desc: [
            //        "",
            //        ""
            //    ]
            //},
            //{
            //    No: 10,
            //    Adage: "",
            //    Author: "",
            //    Desc: [
            //        "",
            //        ""
            //    ]
            //}
        ]
    };
});

// #endregion